---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricArea.DirectionOrigin
source: html/e35286fe-842d-2727-c8de-632e537f9c62.htm
---
# Autodesk.Revit.DB.Structure.FabricArea.DirectionOrigin Property

The Origin Point of the Major Direction of the Fabric Area.

## Syntax (C#)
```csharp
public XYZ DirectionOrigin { get; }
```